Revit 2027 API
ParameterAccess Methods
The ParameterAccess type exposes the following members.
Methods
Name | Description
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetParameter(ElementId, ElementId) |  Retrieves the parameter value for the parameter on the given element.
GetParameter(LinkElementId, Document, ElementId) |  Retrieves the parameter value for the parameter belonging to the parameter document on the given element.
GetType | Gets the Type of the current instance.
(Inherited from Object)
ListParameters(ElementId) |  Retrieves all of the parameters, including extended properties, that are applicable to the element specified by the given id.
ListParameters(LinkElementId) |  Retrieves all of the parameters, including extended properties, that are applicable to the element specified by the given id.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
ParameterAccess Class
Autodesk.Revit.DB Namespace